vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
/**
 * @file dmx.cpp
 */
/* Copyright (C) 2021-2026 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
 
#if defined(CONFIG_TIMER6_HAVE_NO_IRQ_HANDLER)
#error
#endif

#if !defined(CONFIG_DMX_NO_OPTIMIZE)
#pragma GCC push_options
#pragma GCC optimize("O3")
#endif

#include <cstdint>
#include <cstddef>
#include <cstring>
#include <algorithm>
#include <cassert>

#include "gd32/dmx.h" // IWYU pragma: keep
#include "dmx/dmx_config.h"
#include "gd32/dmx_assert.h"
#include "dmxconst.h"
#include "e120.h"
#include "rdmconst.h"
#include "rdm_e120.h"
#include "timing.h"
#include "gd32.h"
#include "gd32_dma.h"
#include "gd32_uart.h"
#include "gd32_gpio.h"
#include "dmx_internal.h"
#if defined(LOGIC_ANALYZER)
#include "logic_analyzer.h" // IWYU pragma: keep
#endif
#include "firmware/debug/debug_debug.h"

static_assert(dmx::buffer::kSize % 4 == 0); // multiple of uint32_t

extern struct HwTimersSeconds gv_seconds;

namespace dmx {
enum class TxRxState { 
  kIdle, 
  kDmxBreak, 
  kDmxMab, 
  kDmxData, 
  kDmxInter,
  kRdmData, 
  kRdmChecksumh, 
  kRdmChecksuml, 
  kRdmdisc 
};

enum class RdmTxState { 
  kIdle, 
  kBreak,
  kMab,
  kData,
  kDirection
};

enum class PortState { 
  kIdle, 
  kTx, 
  kRx 
};

struct DmxTxDataPacket {
    uint8_t data[dmx::buffer::kSize];
    uint32_t length;
};

struct DmxTxPacket {
    DmxTxDataPacket data[2];
    uint32_t write_index;
    uint32_t read_index;
    bool data_pending;
};

struct DmxTxData {
    DmxTxPacket dmx;
    OutputStyle output_style ALIGNED;
    volatile TxRxState state;
};

struct RdmTxDataPacket {
    uint8_t data[sizeof(struct TRdmMessage)];
    uint32_t length;
};

struct RdmTxPacket {
    struct RdmTxDataPacket data;
};

struct RdmTxData {
    RdmTxPacket rdm;
    volatile RdmTxState state;
};

struct DmxTransmit {
    uint32_t break_time;
    uint32_t mab_time;
    uint32_t inter_time;
};

struct RxDmxPackets {
    uint32_t per_second;
    uint32_t count;
    uint32_t count_previous;
};

struct RxDmxData {
    uint8_t data[dmx::buffer::kSize] ALIGNED;
    uint32_t slots_in_packet;
};

struct RxData {
    struct Dmx {
        volatile RxDmxData current;
        RxDmxData previous;
    } dmx ALIGNED;
    struct Rdm {
        volatile uint8_t data[sizeof(struct TRdmMessage)] ALIGNED;
        volatile uint32_t index;
    } rdm ALIGNED;
    volatile TxRxState state;
} ALIGNED;

struct DirGpio {
    uint32_t port;
    uint32_t pin;
};
} // namespace dmx

static constexpr dmx::DirGpio kDirGpio[DMX_MAX_PORTS] = {
    {dmx::config::kDirPort0GpioPort, dmx::config::kDirPort0GpioPin},
#if DMX_MAX_PORTS >= 2
    {dmx::config::kDirPort1GpioPort, dmx::config::kDirPort1GpioPin},
#endif
#if DMX_MAX_PORTS >= 3
    {dmx::config::kDirPort2GpioPort, dmx::config::kDirPort2GpioPin},
#endif
#if DMX_MAX_PORTS >= 4
    {dmx::config::kDirPort3GpioPort, dmx::config::kDirPort3GpioPin},
#endif
#if DMX_MAX_PORTS >= 5
    {dmx::config::kDirPort4GpioPort, dmx::config::kDirPort4GpioPin},
#endif
#if DMX_MAX_PORTS >= 6
    {dmx::config::kDirPort5GpioPort, dmx::config::kDirPort5GpioPin},
#endif
#if DMX_MAX_PORTS >= 7
    {dmx::config::kDirPort6GpioPort, dmx::config::kDirPort6GpioPin},
#endif
#if DMX_MAX_PORTS == 8
    {dmx::config::kDirPort7GpioPort, dmx::config::kDirPort7GpioPin},
#endif
};

static volatile dmx::PortState sv_port_state[dmx::config::max::kPorts] ALIGNED;

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
static volatile dmx::TotalStatistics sv_total_statistics[dmx::config::max::kPorts] ALIGNED;
#endif

// DMX RX
static volatile dmx::RxDmxPackets sv_rx_dmx_packets[dmx::config::max::kPorts] ALIGNED;
// RDM RX
volatile uint32_t gsv_rdm_data_receive_end[dmx::config::max::kPorts];
// DMX RDM RX
static volatile dmx::RxData sv_rx_buffer[dmx::config::max::kPorts] ALIGNED;
// DMX TX
static dmx::DmxTxData s_DmxTxBuffer[dmx::config::max::kPorts] ALIGNED SECTION_DMA_BUFFER;
static dmx::DmxTransmit s_dmx_transmit;
// RDM TX
static dmx::RdmTxData s_RdmTxBuffer[dmx::config::max::kPorts] ALIGNED SECTION_DMA_BUFFER;

template <uint32_t uart, uint32_t port_index>
void IrqHandlerDmxRdmInput() {
    auto& rx_buffer = sv_rx_buffer[port_index];
    const auto kIsFlagIdleFrame = (USART_REG_VAL(uart, USART_FLAG_IDLE) & BIT(USART_BIT_POS(USART_FLAG_IDLE))) == BIT(USART_BIT_POS(USART_FLAG_IDLE));

    // Software can clear this bit by reading the USART_STAT and USART_DATA registers one by one.
    if (kIsFlagIdleFrame) {
        static_cast<void>(GET_BITS(USART_RDATA(uart), 0U, 8U));

        if (rx_buffer.state == dmx::TxRxState::kDmxData) {
            rx_buffer.state = dmx::TxRxState::kIdle;
            rx_buffer.dmx.current.slots_in_packet |= 0x8000;
            return;
        }

        if (rx_buffer.state == dmx::TxRxState::kRdmdisc) {
            rx_buffer.state = dmx::TxRxState::kIdle;
            rx_buffer.rdm.index |= 0x4000;
            return;
        }

        // TODO (a) What kind of status is this?
        return;
    }

    const auto kIsFlagFrameError = (USART_REG_VAL(uart, USART_FLAG_FERR) & BIT(USART_BIT_POS(USART_FLAG_FERR))) == BIT(USART_BIT_POS(USART_FLAG_FERR));

    // Software can clear this bit by reading the USART_STAT and USART_DATA registers one by one.
    if (kIsFlagFrameError) {
        static_cast<void>(GET_BITS(USART_RDATA(uart), 0U, 8U));

        if (rx_buffer.state == dmx::TxRxState::kIdle) {
            rx_buffer.state = dmx::TxRxState::kDmxBreak;
        }

        return;
    }

    const auto kData = static_cast<uint8_t>(GET_BITS(USART_RDATA(uart), 0U, 8U));

    switch (rx_buffer.state) {
        case dmx::TxRxState::kIdle:
            rx_buffer.state = dmx::TxRxState::kRdmdisc;
            rx_buffer.rdm.data[0] = kData;
            rx_buffer.rdm.index = 1;
            break;

        case dmx::TxRxState::kDmxBreak:
            switch (kData) {
                case dmx::kStartCode: {
                    rx_buffer.dmx.current.data[0] = dmx::kStartCode;
                    rx_buffer.dmx.current.slots_in_packet = 1;
                    sv_rx_dmx_packets[port_index].count = sv_rx_dmx_packets[port_index].count + 1;
                    rx_buffer.state = dmx::TxRxState::kDmxData;
                } break;

                case E120_SC_RDM: {
                    rx_buffer.rdm.data[0] = E120_SC_RDM;
                    rx_buffer.rdm.index = 1;
                    rx_buffer.state = dmx::TxRxState::kRdmData;
                } break;

                default:
                    [[unlikely]] {
                        rx_buffer.dmx.current.slots_in_packet = 0;
                        rx_buffer.rdm.index = 0;
                        rx_buffer.state = dmx::TxRxState::kIdle;
                    }
                    break;
            }
            break;

        case dmx::TxRxState::kDmxData: {
            auto index = rx_buffer.dmx.current.slots_in_packet;
            rx_buffer.dmx.current.data[index] = kData;
            index++;
            rx_buffer.dmx.current.slots_in_packet = index;

