vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(dmx::config::kUsart2Port, USART2, USART2_DMAx, USART2_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection: {
                    s_RdmTxBuffer[dmx::config::kUsart2Port].state = dmx::RdmTxState::kIdle;
                    sv_port_state[dmx::config::kUsart2Port] = dmx::PortState::kIdle;
                    Dmx::Get()->SetPortDirection<dmx::config::kUsart2Port, dmx::Direction::kInput, true>();

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    const auto kSent = sv_total_statistics[dmx::config::kUsart2Port].rdm.sent.classes + 1;
                    sv_total_statistics[dmx::config::kUsart2Port].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                } break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        }

        TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH2);
    }
#endif // defined(DMX_USE_USART2)
// UART 3
#if defined(DMX_USE_UART3)
    if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH3) == TIMER_INT_FLAG_CH3) {
        if (s_DmxTxBuffer[dmx::config::kUart3Port].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[dmx::config::kUart3Port].state) {
                case dmx::TxRxState::kDmxInter:
                    [[likely]] {
                        Gd32GpioModeOutput<UART3_GPIOx, UART3_TX_GPIO_PINx>();
                        GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
                        s_DmxTxBuffer[dmx::config::kUart3Port].state = dmx::TxRxState::kDmxBreak;
                        TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
                    }
                    break;
                case dmx::TxRxState::kDmxBreak:
                    [[likely]] {
                        Gd32GpioModeAf<UART3_GPIOx, UART3_TX_GPIO_PINx, UART3>();
                        s_DmxTxBuffer[dmx::config::kUart3Port].state = dmx::TxRxState::kDmxMab;
                        TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.mab_time;
                    }
                    break;
                case dmx::TxRxState::kDmxMab:
                    [[likely]] {
                        DMA_RESTART_DMX_TX(dmx::config::kUart3Port, UART3, UART3_DMAx, UART3_TX_DMA_CHx);
                    }
                    break;
                default:
                    [[unlikely]] break;
            }
        } else if (s_RdmTxBuffer[dmx::config::kUart3Port].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[dmx::config::kUart3Port].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<UART3_GPIOx, UART3_TX_GPIO_PINx, UART3>();
                        s_RdmTxBuffer[dmx::config::kUart3Port].state = dmx::RdmTxState::kMab;
                        TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(dmx::config::kUart3Port, UART3, UART3_DMAx, UART3_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection:
                    [[likely]] {
                        s_RdmTxBuffer[dmx::config::kUart3Port].state = dmx::RdmTxState::kIdle;
                        sv_port_state[dmx::config::kUart3Port] = dmx::PortState::kIdle;
                        Dmx::Get()->SetPortDirection<dmx::config::kUart3Port, dmx::Direction::kInput, true>();

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                        const auto kSent = sv_total_statistics[dmx::config::kUart3Port].rdm.sent.classes + 1;
                        sv_total_statistics[dmx::config::kUart3Port].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        }

        TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH3);
    }
#endif // defined(DMX_USE_UART3)
    // Clear all remaining interrupt flags (safety measure)
    TIMER_INTF(TIMER1) = UINT32_MAX;
}

void TIMER4_IRQHandler() {
// UART 4
#if defined(DMX_USE_UART4)
    if ((TIMER_INTF(TIMER4) & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) [[likely]] {
        if (s_DmxTxBuffer[dmx::config::kUart4Port].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[dmx::config::kUart4Port].state) {
                case dmx::TxRxState::kDmxInter:
                    [[likely]] {
                        Gd32GpioModeOutput<UART4_TX_GPIOx, UART4_TX_GPIO_PINx>();
                        GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
                        s_DmxTxBuffer[dmx::config::kUart4Port].state = dmx::TxRxState::kDmxBreak;
                        TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.break_time;
                    }
                    break;

                case dmx::TxRxState::kDmxBreak:
                    [[likely]] {
                        Gd32GpioModeAf<UART4_TX_GPIOx, UART4_TX_GPIO_PINx, UART4>();
                        s_DmxTxBuffer[dmx::config::kUart4Port].state = dmx::TxRxState::kDmxMab;
                        TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.mab_time;
                    }
                    break;

                case dmx::TxRxState::kDmxMab:
                    [[likely]] {
                        DMA_RESTART_DMX_TX(dmx::config::kUart4Port, UART4, UART4_DMAx, UART4_TX_DMA_CHx);
                    }
                    break;

                default:
                    [[unlikely]] assert(false && "switch");
                    break;
            }
        } else if (s_RdmTxBuffer[dmx::config::kUart4Port].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[dmx::config::kUart4Port].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<UART4_TX_GPIOx, UART4_TX_GPIO_PINx, UART4>();
                        s_RdmTxBuffer[dmx::config::kUart4Port].state = dmx::RdmTxState::kMab;
                        TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

