vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    if (enable_data) {
        DataEnable(port_index);
    }
}

template <uint32_t port_index, dmx::Direction port_direction, bool enable_data>
void Dmx::SetPortDirection() {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if (port_direction_[port_index] != port_direction) {
        port_direction_[port_index] = port_direction;

        DataDisable(port_index);

        if constexpr (port_direction == dmx::Direction::kOutput) {
            GPIO_BOP(kDirGpio[port_index].port) = kDirGpio[port_index].pin;
        } else if constexpr (port_direction == dmx::Direction::kInput) {
            GPIO_BC(kDirGpio[port_index].port) = kDirGpio[port_index].pin;
        } else {
            static_assert(false, "Invalid direction");
        }
    } else if constexpr (!enable_data) {
        DataDisable(port_index);
    }

    if constexpr (enable_data) {
        DataEnable(port_index);
    }
}

void Dmx::DataEnable(uint32_t port_index) {
    DEBUG_PRINTF("port_index=%u", port_index);
    DMX_CHECK_PORT_INDEX_VOID(port_index);
    assert(sv_port_state[port_index] == dmx::PortState::kIdle);

    if (port_direction_[port_index] == dmx::Direction::kOutput) {
        sv_port_state[port_index] = dmx::PortState::kTx;
        s_DmxTxBuffer[port_index].state = dmx::TxRxState::kIdle;
        SetOutputStyle(port_index, GetOutputStyle(port_index));
        return;
    }

    if (port_direction_[port_index] == dmx::Direction::kInput) {
        sv_rx_buffer[port_index].state = dmx::TxRxState::kIdle;

        const auto kUart = DmxPortToUart(port_index);

        do {
            __DMB();
        } while (!Gd32UsartFlagGet<USART_FLAG_TBE>(kUart));

        Gd32UsartInterruptFlagClear<USART_INT_FLAG_RBNE>(kUart);
        Gd32UsartInterruptFlagClear<USART_INT_FLAG_IDLE>(kUart);
        Gd32UsartInterruptEnable<USART_INT_RBNE>(kUart);
        Gd32UsartInterruptEnable<USART_INT_FLAG_IDLE>(kUart);

        sv_port_state[port_index] = dmx::PortState::kRx;
        return;
    }

    assert(false && "Not reachable");
}

void Dmx::DataDisable(uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if (sv_port_state[port_index] == dmx::PortState::kIdle) {
        return;
    }

    sv_port_state[port_index] = dmx::PortState::kIdle;

    const auto kUart = DmxPortToUart(port_index);

    if (port_direction_[port_index] == dmx::Direction::kOutput) {
        do {
            if (s_DmxTxBuffer[port_index].state == dmx::TxRxState::kDmxInter) {
                Gd32UsartFlagClear<USART_FLAG_TC>(kUart);
                do {
                    __DMB();
                } while (!Gd32UsartFlagGet<USART_FLAG_TC>(kUart));

                s_DmxTxBuffer[port_index].state = dmx::TxRxState::kIdle;
            }
        } while (s_DmxTxBuffer[port_index].state != dmx::TxRxState::kIdle);

        return;
    }

    if (port_direction_[port_index] == dmx::Direction::kInput) {
        Gd32UsartInterruptDisable<USART_INT_RBNE>(kUart);
        Gd32UsartInterruptDisable<USART_INT_FLAG_IDLE>(kUart);
        sv_rx_buffer[port_index].state = dmx::TxRxState::kIdle;
        return;
    }

    assert(false && "Not reachable");
}

void Dmx::ClearData(uint32_t port_index) {
    assert(port_index < dmx::config::max::kPorts);

    auto* p = &s_DmxTxBuffer[port_index].dmx.data[0];
    p->length = 513; // Including START Code
    __builtin_memset(p->data, 0, dmx::buffer::kSize);
}

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
volatile dmx::TotalStatistics& Dmx::GetTotalStatistics(uint32_t port_index) {
    sv_total_statistics[port_index].dmx.received = sv_rx_dmx_packets[port_index].count;
    return sv_total_statistics[port_index];
}
#endif

void Dmx::Blackout() {
    DEBUG_ENTRY();

    for (uint32_t port_index = 0; port_index < dmx::config::max::kPorts; port_index++) {
        if (port_direction_[port_index] == dmx::Direction::kOutput) {
            DataDisable(port_index);
            ClearData(port_index);
            DataEnable(port_index);
        }
    }

    DEBUG_EXIT();
}

void Dmx::FullOn() {
    DEBUG_ENTRY();

    for (uint32_t port_index = 0; port_index < dmx::config::max::kPorts; port_index++) {
        if (port_direction_[port_index] == dmx::Direction::kOutput) {
            DataDisable(port_index);

            auto* __restrict__ p = &s_DmxTxBuffer[port_index].dmx.data[0];
            auto* __restrict__ p32 = reinterpret_cast<uint32_t*>(p->data);

            for (auto i = 0; i < dmx::buffer::kSize / 4; i++) {
                *p32++ = UINT32_MAX;
            }

            p->data[0] = dmx::kStartCode;
            p->length = 513;

            DataEnable(port_index);
        }
    }

    DEBUG_EXIT();
}

// DMX Send
template <uint32_t portIndex, bool hasStartCode, dmx::SendStyle dmxSendStyle>
void Dmx::SetSendDataInternal(const uint8_t* data, uint32_t length) {
    DMX_CHECK_PORT_INDEX_VOID(portIndex);

    auto& tx_buffer = s_DmxTxBuffer[portIndex];
    const auto kHasDataPending = tx_buffer.dmx.read_index != tx_buffer.dmx.write_index;

    if (!kHasDataPending) {
        // No pending data — switch to the other buffer
        tx_buffer.dmx.write_index ^= 1;
    }

    const auto kWriteIndex = tx_buffer.dmx.write_index;

    auto* dst_data = tx_buffer.dmx.data[kWriteIndex].data;

    const auto kCappedLength = (length < transmit_slots_) ? length : transmit_slots_;
    tx_buffer.dmx.data[kWriteIndex].length = kCappedLength + 1;

    tx_buffer.dmx.data_pending = true;

    if constexpr (hasStartCode) {
        memcpy(dst_data, data, kCappedLength);
    } else {
        dst_data[0] = dmx::kStartCode;
        memcpy(&dst_data[1], data, kCappedLength);
    }

    if (kCappedLength != transmit_length_[portIndex]) {
        transmit_length_[portIndex] = kCappedLength;
        SetTransmitPeriodTime(transmit_period_requested_);
    }

    if constexpr (dmxSendStyle == dmx::SendStyle::kDirect) {
        StartSendStyleDirect(portIndex);
    }
}

void Dmx::StartSendStyleDirect(uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if ((sv_port_state[port_index] == dmx::PortState::kTx) && (s_DmxTxBuffer[port_index].output_style == dmx::OutputStyle::kDelta) && (s_DmxTxBuffer[port_index].state == dmx::TxRxState::kIdle)) {
        StartDmxOutput(port_index);
    }
}

