vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    SetPortDirection(port_index, dmx::Direction::kOutput, false);

    const auto kUart = DmxPortToUart(port_index);

    for (uint32_t i = 0; i < length; i++) {
        do {
            __DMB();
        } while (!Gd32UsartFlagGet<USART_FLAG_TBE>(kUart));

        USART_TDATA(kUart) = USART_TDATA_TDATA & data[i];
    }

    while (!Gd32UsartFlagGet<USART_FLAG_TC>(kUart)) {
        static_cast<void>(GET_BITS(USART_RDATA(kUart), 0U, 8U));
    }

    TIMER_CNT(TIMER5) = 0;
    do {
        __DMB();
    } while (TIMER_CNT(TIMER5) < rdm::responder::kDataDirectionDelay);

    SetPortDirection(port_index, dmx::Direction::kInput, true);

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
    sv_total_statistics[port_index].rdm.sent.discovery_response = sv_total_statistics[port_index].rdm.sent.discovery_response + 1;
#endif
}

// RDM Receive
const uint8_t* Dmx::RdmReceive(uint32_t port_index) {
    DMX_CHECK_PORT_INDEX_PTR(port_index);

    if ((sv_rx_buffer[port_index].rdm.index & 0x4000) != 0x4000) {
        return nullptr;
    }

    sv_rx_buffer[port_index].rdm.index = 0;

    const auto* p = const_cast<const uint8_t*>(sv_rx_buffer[port_index].rdm.data);

    if (p[0] == E120_SC_RDM) {
        const auto* rdm_command = reinterpret_cast<const struct TRdmMessage*>(p);

        uint32_t i;
        uint16_t checksum = 0;

        for (i = 0; i < 24; i++) {
            checksum = static_cast<uint16_t>(checksum + p[i]);
        }

        for (; i < rdm_command->message_length; i++) {
            checksum = static_cast<uint16_t>(checksum + p[i]);
        }

        if (p[i++] == static_cast<uint8_t>(checksum >> 8)) {
            if (p[i] == static_cast<uint8_t>(checksum)) {
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                sv_total_statistics[port_index].rdm.received.good = sv_total_statistics[port_index].rdm.received.good + 1;
#endif
                return p;
            }
        }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
        sv_total_statistics[port_index].rdm.received.bad = sv_total_statistics[port_index].rdm.received.bad + 1;
#endif
        return nullptr;
    } else {
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
        sv_total_statistics[port_index].rdm.received.discovery_response = sv_total_statistics[port_index].rdm.received.discovery_response + 1;
#endif
    }

    return p;
}

// RDM Receive with timeout
const uint8_t* Dmx::RdmReceiveTimeOut(uint32_t port_index, uint16_t time_out) {
    DMX_CHECK_PORT_INDEX_PTR(port_index);

    uint8_t* p = nullptr;
    TIMER_CNT(TIMER5) = 0;

    do {
        if ((p = const_cast<uint8_t*>(RdmReceive(port_index))) != nullptr) {
            return p;
        }
    } while (TIMER_CNT(TIMER5) < time_out);

    return nullptr;
}

// Explicit template instantiations
template void Dmx::SetTransmitDataWithSC<dmx::SendStyle::kDirect>(const uint32_t, const uint8_t*, uint32_t);
template void Dmx::SetTransmitDataWithSC<dmx::SendStyle::kSync>(const uint32_t, const uint8_t*, uint32_t);

template void Dmx::SetTransmitDataWithoutSC<dmx::SendStyle::kDirect>(const uint32_t, const uint8_t*, uint32_t);
template void Dmx::SetTransmitDataWithoutSC<dmx::SendStyle::kSync>(const uint32_t, const uint8_t*, uint32_t);

template void Dmx::SetSendDataInternal<0, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<0, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<0, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<0, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);

#if DMX_MAX_PORTS >= 2
template void Dmx::SetSendDataInternal<1, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<1, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<1, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<1, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 3
template void Dmx::SetSendDataInternal<2, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<2, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<2, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<2, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 4
template void Dmx::SetSendDataInternal<3, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 5
template void Dmx::SetSendDataInternal<4, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 6
template void Dmx::SetSendDataInternal<5, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 7
template void Dmx::SetSendDataInternal<6, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS == 8
template void Dmx::SetSendDataInternal<7, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if !defined(CONFIG_DMX_NO_OPTIMIZE)
#pragma GCC pop_options
#endif
#pragma GCC push_options
#pragma GCC optimize("Os")
// Configuration
[[gnu::noinline]]
void Dmx::SetTransmitBreakTime(uint32_t break_time) {
    s_dmx_transmit.break_time = std::max(dmx::transmit::kBreakTimeMin, break_time);
    SetTransmitPeriodTime(transmit_period_requested_);
}

[[gnu::noinline]]
uint32_t Dmx::TransmitBreakTime() const {
    return s_dmx_transmit.break_time;
}

[[gnu::noinline]]
void Dmx::SetTransmitMabTime(uint32_t mab_time) {
    s_dmx_transmit.mab_time = std::max(dmx::transmit::kMabTimeMin, mab_time);
    SetTransmitPeriodTime(transmit_period_requested_);
}

[[gnu::noinline]]
uint32_t Dmx::TransmitMabTime() const {
    return s_dmx_transmit.mab_time;
}

[[gnu::noinline]]
void Dmx::SetTransmitPeriodTime(uint32_t period) {
    transmit_period_requested_ = period;

    auto length_max = s_DmxTxBuffer[0].dmx.data[0].length;

